# Програма, яка: 
# Створює список із 10 випадкових цілих чисел у діапазоні від 1 до 50. 
# Виводить цей список на екран.
# Запитує у користувача індекс елемента, який він хоче змінити.
# Запитує нове значення для цього елемента.
# Оновлює список з новим значенням.
# Виводить оновлений список.
# Знаходить та виводить максимальне та мінімальне значення у списку.

import random

random_list = [random.randint(1, 50) for _ in range(10)]
print("Початковий список:", random_list)

index = int(input("Введіть індекс елемента, який ви хочете змінити (від 0 до 9): "))

if 0 <= index < len(random_list):
    new_value = int(input("Введіть нове значення: "))

    # Оновлюємо список
    random_list[index] = new_value
    print("Оновлений список:", random_list)
    max_value = max(random_list)
    min_value = min(random_list)
    print("Максимальне значення у списку:", max_value)
    print("Мінімальне значення у списку:", min_value)
else:
    print("Невірний індекс. Будь ласка, введіть індекс від 0 до 9.")